Sank7383/ESP8266_Newmesh/NewMeshNOW.h
int connum=-1;
void debugdata(const char *buf)
{
  if (connum>=0) webSocket.sendTXT(connum,buf);
}

String hourmin(int timehour)
{
  return String((timehour / 60) % 24) + ":" + String((timehour % 60));
}

void sendFormData(int formno);

void copyString(char array[], String s, int sizearray)
{
  strcpy(array, s.substring(0, sizearray - 1).c_str());
}
void writeEpromS(String s, int address, int length)
{
  int i;
  for (i = 0; i < s.length() && i < length; ++i)
  {
    EEPROM.write(address + i, s[i]);
  }
  for (; i < length; i++)
    EEPROM.write(address + i, 0);
}

void getFormData(const char *formdata, int socketnumber);

void getCurrentStatus1(char *buffer, size_t buflen);

bool AmServer()
{
  if (ethercon==1)
  {
    return 1;
  }
  if (WiFi.status() == 3)
  {
    if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_"))
      return 0;
    else if (WiFi.SSID().startsWith(MESHNETWORK))
      return 0;
    else
      return 1;
  }
  else
    return 1;
}
bool amServer = 1;
char lastmsgsent[200];
unsigned long lastmsgsentat=0;

bool isConnected()
{
  #ifdef ether86
  if (ethercon==1) return eth.isLinked();
  #else
  if (ethercon==1) return true;
  #endif
  if (WiFi.status()==WL_CONNECTED) return true;
  else return false;
}

int senddata(String cdata,String ip="",String url="")
{
  WiFiClient client;
  int httpPort = 80;
  if (WiFi.status()!=WL_CONNECTED) return 0;
  String host=WiFi.gatewayIP().toString();
  if (!client.connect(host, httpPort)) {
    return 0;
  }

  if (cdata.indexOf("EVENT")<0) return 0;
  cdata.replace(" ","%20");
  String streamId="/send?c="+cdata;
  client.print("GET " + streamId + " HTTP/1.1\r\n" +
               "Host: " + String(host)  + "\r\n" +
               "Connection: close\r\n\r\n");
  unsigned long timeout = millis();
  while (client.available() == 0) {
    ESP.wdtFeed(); yield();
    if (millis() - timeout > 500) {
      client.stop();
      return 0;
    }
  }
  client.stop();
  return 1;
}

void sendToAll(const char *msg, int isServer)
{
  if (outTopic[0]==0) {
    snprintf(outTopic, sizeof(outTopic), "light-out/%s/%s", String(ESP.getChipId(), 16).c_str(), ID.c_str());
  }
  String s;
  if (!strncmp(lastmsgsent,msg,199)){
    if (nowmillis-lastmsgsentat<1000  )
    {
      return;
    }
  }
  lastmsgsentat=nowmillis;
  strncpy(lastmsgsent,msg,199);

  if (isServer != 2)
    s = ID + "=" + String(msg);
  else
    s = String(msg);

  if (amServer)
  {
    if (s.indexOf("EVENT:")<0 && s.indexOf("s")!=0) {
      // Local AP-connected clients (this device's own WebSocket server,
      // port 81) are always reachable regardless of whether STA has
      // joined an upstream network — isConnected() must NOT gate this,
      // only whether ESP-NOW mesh forwarding also makes sense below.
      webSocket.broadcastTXT(s.c_str());
#ifdef ESPNOWACTIVE
  sendMeshMessage(0,s.c_str(),1);
#endif
    }
#ifndef MQTTNOTREQUIRED
    if (isServer != 2)
    {
      if (client.connected())
      {
        if (s.indexOf("update_status") < 0 && s.indexOf("room_connect") < 0)
          client.publish(outTopic, msg);
      }
    }
#endif
  }
  else
  {
    {
      if (webSocketClient.isConnected() && isConnected())
        webSocketClient.sendTXT(s.c_str());
      else
      {
        if (s.indexOf("EVENT:")<0) {
          webSocket.broadcastTXT(s.c_str());
#ifdef ESPNOWACTIVE
  sendMeshMessage(0,s.c_str(),1);
#endif
        }
        if (s.indexOf("EVENT:")>=0 ||  s.indexOf("s")==0)
        {
          s=s+",Web";
          senddata(s.c_str());
        }
      }
    }
  }
}

void sendToServer(String msg, int isServer)
{
  String s;
  s = ID + "=" + msg;
  if (amServer)
  {
  }
  else
  {
if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT(s.c_str());
        else
    if (s.indexOf("EVENT:")<0)
     webSocket.broadcastTXT(s.c_str());
  }
}

void deviceData(const char*formdata)
{
  if (strncmp(formdata,"DEVICES:",8)==0)
    formdata = formdata+8;
  int formid = -1;
  char *command = strtok((char *)formdata, " ");
  int id10 = 0;
  char *devname;

  if (command != 0)
  {
    id10 = atoi(command);
    command = strtok(NULL, " ");
  }

  if (command != 0)
  {
    devname = command;
    command = strtok(NULL, " ");
  }
  char ext = 'T';
  if (command != 0)
  {
    ext = (*(char *)command);
    command = strtok(NULL, " ");
  }
  // Alexa device registration dropped for v1 — id10/devname/ext parsed above
  // are kept available for a future non-Alexa device-directory feature.
#ifndef MQTTNOTREQUIRED
  if (client.connected())
    Mysubscribe(id10);
#endif
  return;
}
byte parsem = 0, parser = 0;
char parseMessages[10][301];
bool parseisServer[10];
void decodeString2(const char *msm, int isServer)
{
  if (nowmillis-lastdecode<1000 && strncmp(lastdecodestring,msm,300)==0)
  {
    return;
  }
  lastdecode=nowmillis;
  strncpy(lastdecodestring,msm,300);

  if (parsem < 10)
  {
    if (parsem>0 && parsem>parser){
      if (strncmp(parseMessages[parsem-1],msm,300)==0) return;
    }

    strncpy(parseMessages[parsem],msm,300);
    parseisServer[parsem++] = isServer;
  }
}
void parse_out_loop()
{
  while (parsem > parser)
  {
    decodeString1(parseMessages[parser], parseisServer[parser]);
    parseMessages[parser][0] = 0;
    parseisServer[parser] = false;
    parser++;
  }
  if (parsem == parser and parsem > 0)
  {
    parsem = 0;
    parser = 0;
  }
}

#ifndef MQTTNOTREQUIRED
void Mysubscribe(int id, int unsub)
{
  char subscribe[50];
  strlcpy(subscribe, "light-in/", sizeof(subscribe));

  char myID[10];
  itoa(id, myID, 16);
  strlcat(subscribe, (char *)myID, sizeof(subscribe));
  strlcat(subscribe, "/", sizeof(subscribe));
  itoa(id, myID, 10);
  strlcat(subscribe, (char *)myID, sizeof(subscribe));
  if (unsub == 1)
    client.unsubscribe(subscribe);
  else
    client.subscribe(subscribe);
}

void removeAll()
{
  struct deviceStruct *d = espalexa.extradevices;
  while (d != nullptr)
  {
    if (d->id > 0)
    {
      Mysubscribe(d->id, 1);
    }
    d = d->next;
  }
}
void connectAll()
{
  struct deviceStruct *d = espalexa.extradevices;
  while (d != nullptr)
  {
    if (d->id > 0)
    {
      Mysubscribe(d->id, 0);
    }
    d = d->next;
  }
}
#endif

char subscribe[50];
char myID[10];

#ifndef MQTTNOTREQUIRED
char ds[100];
void ForwardPublish(const char*msm)
{
  struct deviceStruct *d = espalexa.extradevices;

