Sank7383/ESP8266_Newmesh/NewMeshNOW.h
  while (d != nullptr)
  {
    if (d->id > 0)
    {
      sprintf(ds,"%d=",d->id);
      if (strncmp(msm,ds,strlen(ds))==0)
      {
        strlcpy(subscribe, "light-out/", sizeof(subscribe));
        itoa(d->id, myID, 16);
        strlcat(subscribe, (char *)myID, sizeof(subscribe));
        strlcat(subscribe, "/", sizeof(subscribe));
        itoa(d->id, myID, 10);
        strlcat(subscribe, (char *)myID, sizeof(subscribe));
        client.publish(subscribe, msm+strlen(ds));
        return;
      }
    }
    d = d->next;
  }
}
#endif
int devicelist = 0;
void decodeString1(const char *msm, int isServer)
{
  debugdata(msm);
  lastdecode=nowmillis;
  if (!msm) return;
  if (strncmp(msm,"DEVICES:",8)==0)
  {
    deviceData(msm);
  }

  if (isServer == 1)
  {
    // A directly-connected local client (this device's own WebSocket
    // server, port 81) is unambiguously talking to exactly this one
    // device — no "<thisDeviceID>=" address prefix required. Commands
    // like "Test"/"GS"/"RESPONSE:..." fall straight through to the
    // dispatch block below as-is.
  }
  else if (isServer == 0 || isServer == 2)
  {
    // Relayed/mesh-origin traffic (this device acting as an uplink client,
    // or a message forwarded over ESP-NOW) DOES need the address prefix
    // stripped, since a shared medium can carry messages meant for other
    // devices too.
    debugdata(String("Received by Client from above ").c_str());
    debugdata(msm);
    if (strstr(msm,"EVENT:")) return;
    if (strstr(msm,"R1Gnull")) return;
    if (strncmp(msm,"NDEVICELIST",10)==0)
    {
      devicelist=0;
      String msg = "DEVICES:" + ID + " " + myConfig.myDeviceName + " " + String(myConfig.myDeviceIdentification);
      sendToAll(msg.c_str(), 2);
      decodeString(msm, 0);
      return;
    }

    char buf[1024];
    sprintf_P(buf, PSTR("%s="),ID.c_str());

    if (strncmp(msm,buf,strlen(buf))==0)
    {
      msm = msm+strlen(buf);
    }
    else
    {
#ifdef MASTERCONTROLLER
      if (strncmp(msm,"s",1)==0){
        decodeString(msm,0);
      }
#endif
#ifdef NURSECALLNEW
      if (strncmp(msm,"j",1)==0){
        decodeString(msm,0);
      }
      if (strncmp(msm,"os",2)==0 && *(msm+strlen(msm)-1)=='9'){
        decodeString(msm,0);
      }
      if (strstr(msm,"=s")){
        decodeString(msm,0);
      }
#endif
      return;
    }
  }

  if (!strncmp(msm,"SOCKETCLIENTCONNECTED",10))
  {
    devicelist=1;
  }
  else
  if (!strncmp(msm,"GS",2))
  {
    getCurrentStatus1(msgp, sizeof(msgp));
    sendMeshMessage(0,String(msgp),1);
  }
  else if (!strncmp(msm,"Reboot",7))
  {
    ESPrestart();
  }
  else if (!strncmp(msm,"Reset",6))
  {
    ESPrestart();
  }
  else if (!strncmp(msm,"Test",5))
  {
    sendFormData(0);
  }
  else if (!strncmp(msm,"RESPONSE:",9))
  {
    getFormData(msm, 2);
  }
  else if (!strncmp(msm,"UPDATE",7))
  {
    ESP.wdtFeed();
    handleBinUpdate(1);
  }
  else
    decodeString(msm, 0);
}
int wscdisconnect = 0;
void webSocketEventClient(WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    lst_wscon=0;
    if (isConnected())
      wscdisconnect++;
    if (wscdisconnect > 20 && !amServer)
    {
        wscdisconnect=0;
    }
    break;
  case WStype_CONNECTED:
  {
    lst_wscon= millis();
    wscdisconnect = 0;
    disconnectcount = 0;
    if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT("ESP");
    String msg = "DEVICES:" + ID + " " + String(myConfig.myDeviceName) + " " + String(myConfig.myDeviceIdentification);
    if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT(msg);
    sendAllDevices();
  }
  break;
  case WStype_TEXT:
    {
    if (strstr((const char *)payload,"INFO:")) return;
    if (strstr((const char *)payload,"Info:")) return;
    if (strstr((const char *)payload,"o")==(const char *)payload) {
      if (strstr((const char *)payload,",9")==NULL){
        return;
      }
    }

    if (strstr((const char *)payload,"IGNORE:")) return;
    if (strstr((const char *)payload,"R1G")==(const char *)payload) return;
    debugdata(String("Received by webSocketClient").c_str());
    debugdata((const char *)payload);

    if (amServer)
    {
#ifdef NURSECALLNEW
    sendMeshMessage(0,(const char *)payload,1,2);
#endif
    }
    else
    {
    }
    if (amServer==0){
      decodeString2((const char *)payload, 0);
    }
    else{
      decodeString2((const char *)payload, 1);
    }
    }
    break;
  case WStype_BIN:
{
  if (length != sizeof(MeshPacket)) return;
  int nextHead = (rxHead + 1) % RX_QUEUE_SIZE;
  if (nextHead == rxTail) {
    return;
  }
  memcpy(&rxQueue[rxHead], payload, length);
  rxHead = nextHead;
  }
    break;
  case WStype_PING:
    break;
  case WStype_PONG:
    break;
  }
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    if (connum==num) connum=-1;
    if(num<5)
    ESPN[num]=0;
    break;
  case WStype_CONNECTED:
  {
    if (connum==-1) connum=num;
    if(num<5)
    ESPN[num] = 1;
    IPAddress ip = webSocket.remoteIP(num);
    webSocket.sendTXT(num, String("Connected:" + ID + ":1").c_str());
  }
  break;
  case WStype_PING:
  case WStype_PONG:
  break;
  case WStype_TEXT:
  {
    if (connum==num) connum=-1;
    if (strstr((const char *)payload,"IGNORE:")) return;
    if(num<5)
    if ((char)payload[0] == 'E' && (char)payload[1] == 'S' && (char)payload[2] == 'P' && length == 3)
    {
      ESPN[num] = 2;
      devicelist=1;
      return;
    }

    if (amServer)
    {
#ifndef MQTTNOTREQUIRED
        if (amServer==1){
          if (client.connected())
          {
            {
              ForwardPublish((const char *)payload);
            }
          }
        }
#endif
#ifdef ESPNOWACTIVE
    sendMeshMessage(0,(const char *)payload,1,2);
#endif
    }
    else
    {
#ifdef ESPNOWACTIVE
      sendMeshMessage(0,(const char *)payload,1);
#endif
    }
    decodeString2((const char *)payload, 1);
  }
    break;
  case WStype_BIN:
  if (length != sizeof(MeshPacket)) return;
  int nextHead = (rxHead + 1) % RX_QUEUE_SIZE;
  if (nextHead == rxTail) {
    return;
  }
  memcpy(&rxQueue[rxHead], payload, length);
  rxHead = nextHead;
    break;
  }
}

// ==========================================
// AP identity — always-on, two live states
// ==========================================
// The device runs AP+STA concurrently at all times, regardless of which
// route (WiFi mesh / RS485 / Ethernet) is selected, so on-site staff can
// always reach the settings page — the AP never turns off. Its IDENTITY
// does still reflect live connection state, matching the pre-rewrite
// behavior: standalone (no upstream network joined) broadcasts
// "NETE<asccode><id>" on 192.168.6.x; once bridged to a real upstream
// WiFi network it switches to "MESH<asccode><id>" on 192.168.(100+id).x
// so other mesh nodes can find it. Both asccode/id are read live, so a
// settings change takes effect the next time this re-evaluates.
bool apInitialized = false;
bool lastApConnectedState = false;   // forces the first setup_AP() call through
void setup_AP(bool forceRestart)
{
  if(manulalAP==true) return ;

  bool connected = isConnected();

  if (apInitialized && !forceRestart) return;
  if (apInitialized && connected == lastApConnectedState) return;   // nothing actually changed
  apInitialized = true;
  lastApConnectedState = connected;

  uint8_t octet3 = connected ? (100 + (myConfig.machineid & 0xFF)) : 6;
  if (octet3 > 250 || octet3 == 0) octet3 = 6;

