Sank7383/ESP8266_Newmesh/NewMeshNOW.h
  apIP = IPAddress(192, 168, octet3, 1);
  IPAddress apGateway(apIP);
  IPAddress apSubmask(255, 255, 255, 0);
  WiFi.softAPdisconnect(true);
  WiFi.softAPConfig(apIP, apGateway, apSubmask);

  String apSsid = connected ? (MESHNETWORK + String(myConfig.asccode) + String(myConfig.machineid))
                             : ("NETE" + String(myConfig.asccode) + String(myConfig.machineid));
  const char *apPassword = connected ? "MESHPASSWORD" : "Netsol@123";
  WiFi.softAP(apSsid.c_str(), apPassword, myConfig.wifiChannel ? myConfig.wifiChannel : 1, 0, 4);
  dbgPrintln(1, "Initialized AP as IP '" + apIP.toString() + "' SSID " + apSsid);
}

WiFiEventHandler gotIpEventHandler, disconnectedEventHandler, SoftAPModeStationDisconnected, SoftAPModeStationConnected;

byte ssidconnected=0;
void connectWiFiEvents()
{
  SoftAPModeStationConnected = WiFi.onSoftAPModeStationConnected([](const WiFiEventSoftAPModeStationConnected &event)
                                                                 {
                                                                 });

  SoftAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected([](const WiFiEventSoftAPModeStationDisconnected &event)
                                                                       {
                                                                       });

  gotIpEventHandler = WiFi.onStationModeGotIP([](const WiFiEventStationModeGotIP &event)
                                              {
                                                IPAddress ipipad;
                                                ipipad = WiFi.localIP();
                                                if (ipipad[0] <= 0)
                                                {
                                                  WiFi.disconnect();
                                                  return;
                                                }
                                                if (WiFi.SSID() == myConfig.mySSID)
                                                {
                                                  ssidconnected=0;
                                                  String ipad = myConfig.myIP;
                                                  String netm = myConfig.myNetmask;
                                                  String gatw = myConfig.myGateway;
                                                  IPAddress ipipad, ipnetm, ipgatw,ipdns;
                                                  ipdns.fromString("8.8.8.8");
                                                  if (ipipad.fromString(ipad.c_str()) == 1 && ipnetm.fromString(netm.c_str()) == 1 && ipgatw.fromString(gatw.c_str()) == 1)
                                                  {
                                                    if (ipipad[0] > 0)
                                                      WiFi.config(ipipad, ipgatw, ipnetm, ipgatw,ipdns);
                                                  }
                                                }
                                                amServer = AmServer();
                                                setup_AP(true);   // re-evaluate AP subnet now that STA is bridged (SSID unchanged)
                                                if (WiFi.SSID().startsWith(MESHNETWORK) || WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_")  )
                                                {
                                                  if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_") )
                                                    netsoltime = nowmillis;
                                                  else
                                                    netsoltime = 0;
                                                  if (webSocketClient.isConnected()) webSocketClient.disconnect();
                                                  webSocketClient.begin(WiFi.gatewayIP(), 81, "/");
                                                  webSocketClient.onEvent(webSocketEventClient);
                                                  webSocketClient.setReconnectInterval(2000);
                                                  webSocketClient.enableHeartbeat(3000, 3000, 2);
                                                }
                                                else
                                                {
#ifndef MQTTNOTREQUIRED
                                                  if (amServer==1){
                                                    client.setServer("www.ask4token.com", 1883);
                                                    client.setCallback(callback);
                                                  }
#endif
#ifdef NURSECALLNEW
if (!myConfig.socketio){
                                                  if (strlen(myConfig.myServer) > 0 && isConnected())
                                                  {
                                                    webSocketClient.begin(myConfig.myServer, myConfig.myPort, "/","");
                                                    webSocketClient.onEvent(webSocketEventClient);
                                                    webSocketClient.setReconnectInterval(2000);
                                                    webSocketClient.enableHeartbeat(3000, 3000, 2);
                                                  }
}
#endif
                                                }
                                              });

  disconnectedEventHandler = WiFi.onStationModeDisconnected([](const WiFiEventStationModeDisconnected &event)
                                                            {
                                                              disconnectcount++;
                                                              ssidconnected++;
                                                              if (ssidconnected<5)
                                                              {
                                                                WiFi.reconnect();
                                                                myruntime = nowmillis+10000;
                                                                return;
                                                              }
                                                              ssidconnected = 0;
                                                              if (disconnectcount > 30)
                                                              {
                                                                disconnectcount = 0;
                                                              }
                                                              WiFi.disconnect(true);
                                                              amServer = AmServer();
                                                              webSocketClient.setReconnectInterval(300000);
                                                              if (webSocketClient.isConnected()) webSocketClient.disconnect();
                                                              // AP stays up regardless of STA connection state — only its
                                                              // subnet falls back to standalone (192.168.6.x); SSID unchanged.
                                                              setup_AP(true);
                                                              myruntime = nowmillis+10000;
                                                            });
}

char messg[1000];
void callback(char *topic, byte *payload, unsigned int length)
{
  char *data = (char *)topic;
  if (strstr(data, "/"))
    data = strstr(data, "/") + 1;
  if (strstr(data, "/"))
    data = strstr(data, "/") + 1;
  strlcpy(messg, data, sizeof(messg));
  strlcat(messg, "=", sizeof(messg));
  size_t messglen = strlen(messg);
  memcpy(messg + messglen, payload, length);
  messg[messglen + length] = 0;

  sendToAll(messg,2);
  decodeString2(messg, 2);
}
#ifndef MQTTNOTREQUIRED
boolean mqttconnected = 0;
uint8_t mqttserver = 0;
int value = 0;
boolean reconnect()
{
  String clientId = "EClient-";
  clientId += ID;
  const char *username = "mqtt_user_name";
  const char *password = "mqtt_password";
  mqttserver++;
  if (mqttserver > 3)
    mqttserver = 0;
  client.setServer(mqtt_server[mqttserver], 1883);
  client.setCallback(callback);
  client.setBufferSize(1024);
  if (!isConnected()) return false;

  if (client.connect(clientId.c_str(), username, password))
  {
    mqttconnected = 1;
    Mysubscribe(atoi(ID.c_str()));
    connectAll();
    return true;
  }
  return client.connected();
}

