Sank7383/ESP8266_Newmesh/NewMeshNOW.h
uint32_t ith=0;
uint32_t getInternalBootCode()
{
    uint32_t result;
    ESP.rtcUserMemoryRead (0, (uint32_t*) &result, sizeof(result));
    ith=result;
    return result;
}

void setInternalBootCode(uint32_t value)
{
    uint32_t storeValue = value;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &storeValue, sizeof(storeValue));
    getInternalBootCode();
}

void startconnection()
{
  // Config is already loaded (with structVersion-guarded defaults applied)
  // by configLoad() in NurseCallConfig.cpp, called once from setup() before
  // this — do not reload/overwrite myConfig here.
  getInternalBootCode();
  if (myConfig.machineid<0) myConfig.machineid=0;
  WiFi.persistent(false);

  WiFi.mode(WIFI_AP_STA);
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(true);
  WiFi.setOutputPower(20.5);
  setup_AP();
  connectWiFiEvents();

  addAP("test_ms", "netsol@123MS");

  if (String(myConfig.mySSID).length() > 3 && String(myConfig.myPass).length() > 3 && ethercon==0)
    addAP(myConfig.mySSID, myConfig.myPass);

  if (myConfig.machineid>0)
    addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-1)).c_str(), "MESHPASSWORD");
  if (myConfig.machineid>1)
    addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-2)).c_str(), "MESHPASSWORD");

  addAP("homeauto", "HA@123home");
  addAP("test_ms10", "netsol@123MS");

  myrun();

  webSocket.begin();
  webSocket.enableHeartbeat(3000, 3000, 2);
  webSocket.onEvent(webSocketEvent);

  server.on("/forms", []()
            {
              server.send_P(200, "text/html", FORMS_PAGE);
            });
  server.on("/reboot", []()
            {
              server.send(200, "text/html", "OK");
              ESPrestart();
            });
  server.on("/send", []()
            {
              sendToAll(server.arg("c").c_str(),2);
              decodeString2(server.arg("c").c_str(),1);
              server.send(200, "text/html", "OK");
            });

  server.on("/settingn", []()
            {
            copyString(myConfig.mySSID,server.arg("ssid"),sizeof(myConfig.mySSID));
            copyString(myConfig.myPass,server.arg("pass"),sizeof(myConfig.myPass));
            copyString(myConfig.myDeviceName,server.arg("ascs"),sizeof(myConfig.myDeviceName));
            myConfig.machineid=atoi(server.arg("ports").c_str());
            copyString(myConfig.myIP,server.arg("ips"), sizeof(myConfig.myIP));
            copyString(myConfig.myGateway,server.arg("gates"), sizeof(myConfig.myGateway));
            copyString(myConfig.myNetmask,server.arg("netmasks"), sizeof(myConfig.myNetmask));

   EEPROM.put(100, myConfig);
    EEPROM.commit();
    ESP.wdtFeed();

    String content = "{\"Success\":\"saved to eeprom... reset to boot into new wifi\"}<script>document.location='/reboot';</script>";
  server.send(200, "text/html", content);
            });
  server.on("/id", []() {
    String s = "MySetID:"+String(ID)+"\n";
    server.send(200, "text/plain", s);
  });

  server.on("/", []()
            {
              getCurrentStatus1(msgp, sizeof(msgp));
              String msgs=String(msgp);
              msgs.replace(",", "<br>");
              server.send(200, "text/html", msgs + F("<br><a href='/forms'>Settings</a><br><a href='/reboot'>Reboot</a>"));
            });

  server.on("/refreshlist", HTTP_GET, []()
            {
              devicelist=1;
              server.send(200, "text/plain", "Refresh Ok");
            });

  server.begin();
  if (myConfig.myDeviceIdentification > 127)
    myConfig.myDeviceIdentification = 'T';
}

long lastgettime = 0;

// Device-directory (Alexa extradevices list) dropped for v1 along with
// Espalexa — both are now no-ops kept only so existing call sites compile
// unchanged; DeviceProtocol.cpp owns device status going forward.
void sendAllDevices()
{
}
void removeExtra()
{
}

void myrun()
{
  unsigned long t = millis();
  nowmillis=millis();
  wl_status_t status;
  parse_out_loop();
  webSocket.loop();

  if (isConnected())
    webSocketClient.loop();

#ifndef MQTTNOTREQUIRED
  if (amServer==1)
    mqttloop();
#endif

  server.handleClient();
  status = WiFi.status();
  if (ethercon==1) status=WL_CONNECTED;
  if ((firsttime < 120) && (t>30000) && (status!=WL_CONNECTED))
  {
      firsttime++;
      if (firsttime == 120)
      {
        if (myConfig.type[0]==1){
          if (myConfig.machineid>0)
            addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-1)).c_str(), "MESHPASSWORD");
          if (myConfig.machineid>1)
           addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-2)).c_str(), "MESHPASSWORD");
        }
      }
  }

  if ((t - last_10sec) > 5000)
  {
    if (devicelist==1)
    {
      devicelist = 0;
    }
    if (ESP.getFreeHeap()<5100)
    {
      setup_AP(true);
    }

    counter++;
    last_10sec = t;
  }
  if (t < myruntime)
    return;
  if (t - myruntime < 1000)
    return;

  myruntime = t;
  removeExtra();

  if (ethercon==1) return;
  if (_firstRun)
  {
    _firstRun = false;
    if (strlen(WiFi.SSID().c_str()))
    {
      WiFi.begin();
    }
  }

  if (status == WL_CONNECTED)
  {
    if (firsttime<120) firsttime=0;
    if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_") )
    {
      if (t - netsoltime > 300000 && netsoltime > 0)
      {
        WiFi.disconnect();
        myrunmode = 0;
        return;
      }
    }
    if (WiFi.status() == 3 && WiFi.localIP().toString() == "(IP unset)")
      WiFi.disconnect(true);
    myruncount = 0;
    return;
  }

  if (myrunmode == 0)
  {
    if (myConfig.type[0]==2 && myConfig.mesh_en) return;
    WiFi.disconnect();
    WiFi.scanDelete();
    WiFi.disconnect();
    WiFi.scanNetworks(true);
    myrunmode = 1;
    myruncount++;
    return;
  }

  if (myrunmode == 1)
  {
    scanResult = WiFi.scanComplete();
    if (scanResult < 0)
      return;
    myrunmode = 2;
  }

  if (myrunmode == 2)
  {
    numNetworks = 0;
    for (int8_t i = 0; i < scanResult && numNetworks < 20; i++)
    {
      String ssid;
      WiFi.getNetworkInfo(i, ssid, encType, rssi, bssid, channel, hidden);
      for (auto entry : _APlist)
      {
        if (ssid == entry.ssid)
        {
          known[numNetworks++] = i;
          break;   // one match per scanned network is enough; also bounds numNetworks < 20 via the outer loop guard
        }
      }
    }
    if (numNetworks == 0)
    {
      myrunmode = 3;
      for (uint8_t j = 0; j < _APlist.size(); j++)
      {
        auto &entry = _APlist[j];
        WiFi.begin(entry.ssid, entry.passphrase);
        break;
      }
      myrunmodeindex=1;
      myruntime = myruntime + 30000;
      ssidconnected=0;
      return;
    }

    myrunmode = 3;
    for (int i = 0; i < numNetworks; i++)
    {
      for (int j = i + 1; j < numNetworks; j++)
      {
        if (WiFi.RSSI(known[j]) > WiFi.RSSI(known[i]))
        {
          int8_t tmp;
          tmp = known[i];
          known[i] = known[j];
          known[j] = tmp;
        }
      }
    }
    myrunmodeindex = 0;
  }
  if (myrunmode == 3)
  {
    if (myrunmodeindex == numNetworks)
    {
      myruncount++;
      if (myruncount > 15)
      {
        myruncount = 0;
      }
      myrunmode = 0;
      myruntime = myruntime + 1000;
      return;
    }
    String ssid;
    WiFi.getNetworkInfo(known[myrunmodeindex], ssid, encType, rssi, bssid, channel, hidden);

    for (uint8_t j = 0; j < _APlist.size(); j++)
    {
      auto &entry = _APlist[j];
      if (ssid == entry.ssid)
      {
        if (ssid == "NETSOL" && (WiFi.softAPgetStationNum() > 0 || myruncount < 10))
        {
        }
        else
          WiFi.begin(ssid, entry.passphrase, channel, bssid);
        ssidconnected=0;
        myrunmodeindex++;
        myruntime = myruntime + 30000;
        return;
      }
    }

    myrunmode = 0;
    myruntime = myruntime + 1000;
    return;
  }

  return;
}
